import '../models/chapter_model.dart';
import '../models/course_model.dart';
import '../models/quiz_model.dart';

List<Chapter> getChaptersForLevelAndYear(String level, String year) {
  // Replace this with actual logic to fetch chapters based on level and year
  return [
    Chapter(
      number: "الوحدة التعليمية الأولى",
      title: 'حضارات ما قبل التاريخ',
      courses: [
        Course(
          number: "الأولى",
          title: 'دراسة الآثار القديمة',
          isCompleted: false,
          content: '''
                # دراسة الآثار القديمة
                ---
                ## **خطوات دراستها**
                ---
                ### 1. **المقدمة**
                ---
                - **طبيعة الأثر:** تمثال أثري يعود إلى العصر الروماني.
                - **مصدره:** اكتشافه ضمن حفريات أثرية بمنطقة تيبازة، الجزائر.
                - **صاحبه:** يعتقد أنه يمثل شخصية أسطورية أو قائدًا بارزًا في المجتمع الروماني.
                - **الإطار الزماني والمكاني:** يعود إلى القرن الثاني الميلادي، تيبازة كموقع أثري روماني على الساحل الجزائري.
                ---
                ### 2. **التحليل**
                ---
                #### **الفكرة العامة:**
                فهم دلالات التمثال الثقافية والاجتماعية وأهميته التاريخية ضمن الحضارة الرومانية.
                ---
                #### **الأفكار الجزئية:**
                ---
                - **التقنية والأسلوب:** التمثال منحوت بدقة تعكس تطور الفن الروماني، مصنوع من الرخام.
                - **الأبعاد الرمزية:** يمثل شخصية أسطورية مرتبطة بالديانة الرومانية في تلك الفترة.
                - **السياق التاريخي:** وجود التمثال في تيبازة يشير إلى أهمية المدينة كجزء من المستعمرات الرومانية
                ---
                ### 3. **الاستنتاج**
                ---
                - **استنتاجات رئيسية:** يعكس التمثال تطور الفن الروماني وتأثير الثقافة الرومانية على شمال إفريقيا.
                - **الأهمية التاريخية:** يعتبر التمثال دليلًا ماديًا على العلاقات الثقافية والسياسية بين الإمبراطورية الرومانية والمناطق التي احتلتها.
                - **التوصيات:** ضرورة حفظ التمثال ودراسته بشكل أعمق للكشف عن مزيد من المعلومات حول الحياة الاجتماعية والدينية في تلك الحقبة.
                ''',
          quiz: Quiz(
            title: 'اختبار: دراسة الآثار القديمة',
            questions: [
              Question(
                questionText: 'ما المادة الرئيسية للتمثال؟',
                choices: ['رخام', 'جرانيت', 'حجر جيري', 'خشب'],
                correctAnswer: 'رخام',
              ),
              Question(
                questionText: 'في أي مدينة تم اكتشاف التمثال؟',
                choices: ['تيبازة', 'تيمقاد', 'جميلة', 'قالمة'],
                correctAnswer: 'تيبازة',
              ),
              Question(
                questionText: 'ما هو الدور الرمزي للتمثال؟',
                choices: [
                  'تمثيل ديني',
                  'تمثيل اجتماعي',
                  'تمثيل تجاري',
                  'تمثيل سياسي'
                ],
                correctAnswer: 'تمثيل ديني',
              ),
              Question(
                questionText: 'ما العصر الذي ينتمي إليه التمثال؟',
                choices: ['الروماني', 'العثماني', 'البيزنطي', 'الإسلامي'],
                correctAnswer: 'الروماني',
              ),
            ],
          ),
        ),
        Course(
          number: "الثانية",
          title: 'الآثار عنوان الفترة التي عاشها الإنسان',
          isCompleted: false,
          content: '''
                # الآثار عنوان الفترة التي عاشها الإنسان
                
                ## **المقدمة**
                - **الآثار:** هي البقايا المادية للحضارات القديمة التي تعكس تطور الإنسان وحياته الاجتماعية والاقتصادية والثقافية.
                - **الأهمية:** تعتبر الآثار مصدرًا هامًا لدراسة التاريخ والحضارات القديمة وتوثيق تطور الإنسان على مر العصور.
                
                ---
                
                ## **العصور التاريخية**
                ### 1. **العصور القديمة**
                - **العصر الحجري:** عصر بدأ في العصر الحجري القديم وانتهى بانتقال الإنسان إلى الزراعة والرعي.
                - **العصر النحاسي:** عصر انتقال الإنسان إلى استخدام النحاس في صناعة الأدوات والسلاح.
                - **العصر البرونزي:** عصر استخدام البرونز في صناعة الأدوات والأسلحة.
                - **العصر الحديدي:** عصر استخدام الحديد في صناعة الأدوات والأسلحة.

                ### 2. **العصور الوسطى**
                - **العصر القديم:** عصر انتقال الإنسان من الحياة البرية إلى الحياة الحضرية.
                - **العصر الوسيط:** عصر انتقال الإنسان من الحضارة القديمة إلى الحضارة الحديثة.
                ''',
          quiz: Quiz(
            title: 'اختبار: الآثار عنوان الفترة التي عاشها الإنسان',
            questions: [
              Question(
                questionText: 'ما هي أهمية الآثار؟',
                choices: [
                  'توثيق التاريخ',
                  'تزيين المدن',
                  'ترويج السياحة',
                  'التجارة'
                ],
                correctAnswer: 'توثيق التاريخ',
              ),
              Question(
                questionText: 'ما هو العصر الذي استخدم فيه البرونز لأول مرة؟',
                choices: ['الحجري', 'البرونزي', 'النحاسي', 'الحديدي'],
                correctAnswer: 'البرونزي',
              ),
              Question(
                questionText: 'ما هي المادة التي استخدمت في العصر الحجري؟',
                choices: ['الحجر', 'النحاس', 'الحديد', 'الرصاص'],
                correctAnswer: 'الحجر',
              ),
              Question(
                questionText: 'أي عصر تميز باستخدام الحديد؟',
                choices: ['الحديدي', 'الحجري', 'النحاسي', 'البرونزي'],
                correctAnswer: 'الحديدي',
              ),
            ],
          ),
        ),
        Course(
          number: "الثالثة",
          title: 'كرونولوجيا عصور ما قبل التاريخ',
          isCompleted: false,
          content: '''
                # كرونولوجيا عصور ما قبل التاريخ

                ## **المقدمة**
                - **التاريخ:** هو دراسة الماضي وتوثيق الأحداث والتطورات التي شهدها الإنسان على مر العصور.
                - **التاريخ القديم:** يعتبر العصور القديمة من أهم فترات التاريخ التي شهدت تطورًا كبيرًا في الحضارة الإنسانية.
                - **التاريخ الحديث:** يعتبر العصور الحديثة من أهم فترات التاريخ التي شهدت تقدمًا كبيرًا في العلوم والتكنولوجيا.

                ---

                ## **العصور القديمة**
                ### 1. **العصر الحجري**
                - **العصر القديم:** عصر بدأ في العصر الحجري القديم وانتهى بانتقال الإنسان إلى الزراعة والرعي.
                - **العصر النحاسي:** عصر انتقال الإنسان إلى استخدام النحاس في صناعة الأدوات والسلاح.
                - **العصر البرونزي:** عصر استخدام البرونز في صناعة الأدوات والأسلحة.
                - **العصر الحديدي:** عصر استخدام الحديد في صناعة الأدوات والأسلحة.

                ### 2. **العصور الوسطى**
                - **العصر القديم:** عصر انتقال الإنسان من الحياة البرية إلى الحياة الحضرية.
                ''',
          quiz: Quiz(
            title: 'Quiz on دراسة الآثار القديمة',
            questions: [
              Question(
                questionText: 'What is the main material of the statue?',
                choices: ['Marble', 'Granite', 'Limestone', 'Sandstone'],
                correctAnswer: 'Marble',
              ),
              Question(
                questionText: 'In which century was the statue created?',
                choices: [
                  '1st century',
                  '2nd century',
                  '3rd century',
                  '4th century'
                ],
                correctAnswer: '2nd century',
              ),
            ],
          ),
        ),
      ],
      backgroundImage: 'assets/images/chapter1.png',
    ),
    Chapter(
      number: "الوحدة التعليمية الثانية",
      title: 'التاريخ الوطني',
      courses: [
        Course(
          number: "الأولى",
          title: 'العصر الإسلامي',
          isCompleted: false,
          content: '''
                # العصر الإسلامي

                ## **المقدمة**
                - **العصر الإسلامي:** هو الفترة التي تلت الفتوحات الإسلامية وشهدت تأسيس الدولة الإس''',
          quiz: Quiz(
            title: 'اختبار: دراسة الآثار القديمة',
            questions: [
              Question(
                questionText: 'ما المادة الرئيسية للتمثال؟',
                choices: ['رخام', 'جرانيت', 'حجر جيري', 'خشب'],
                correctAnswer: 'رخام',
              ),
              Question(
                questionText: 'في أي مدينة تم اكتشاف التمثال؟',
                choices: ['تيبازة', 'تيمقاد', 'جميلة', 'قالمة'],
                correctAnswer: 'تيبازة',
              ),
              Question(
                questionText: 'ما هو الدور الرمزي للتمثال؟',
                choices: [
                  'تمثيل ديني',
                  'تمثيل اجتماعي',
                  'تمثيل تجاري',
                  'تمثيل سياسي'
                ],
                correctAnswer: 'تمثيل ديني',
              ),
              Question(
                questionText: 'ما العصر الذي ينتمي إليه التمثال؟',
                choices: ['الروماني', 'العثماني', 'البيزنطي', 'الإسلامي'],
                correctAnswer: 'الروماني',
              ),
            ],
          ),
        ),
        Course(
          number: "الثانية",
          title: 'العصر العثماني',
          isCompleted: false,
          content: '''
                # العصر العثماني

                ## **المقدمة**
                - **العصر العثماني:** هو الفترة التي تلت الفتوحات الإسلامية وشهدت تأسيس الدولة الإسلامية العثمانية.
                - **التاريخ:** بدأ العصر العثماني في القرن الثالث عشر الميلادي وانتهى في القرن العشرين الميلادي.
                - **الموقع:** كانت الدولة العثمانية تمتد على أجزاء كبيرة من آسيا وأوروبا وأفريقيا.

                ---

                ## **التطورات السياسية**
                ### 1. **تأسيس الدولة العثمانية**
                - **المؤسس:** تأسست الدولة العثمانية على يد عثمان بن أرطغرل في القرن الثالث عشر الميلادي.
                - **التوسع الإقليمي:** شهدت الدولة العثمانية توسعًا كبيرًا في القرون اللاحقة لتشمل أجزاء كبيرة من العالم الإسلامي.

                ### 2. **التحولات السياسية**
                - **التحولات الداخلية:** شهدت الدولة العثمانية تحولات داخلية كبيرة في القرون اللاحقة نتيجة للتحديات السياسية والاقتصادية.
                - **التحولات الخارجية:** تعرضت الدولة العثم''',
          quiz: Quiz(
              title: 'اختبار: الآثار عنوان الفترة التي عاشها الإنسان',
              questions: [
                Question(
                  questionText: 'ما هي أهمية الآثار؟',
                  choices: [
                    'توثيق التاريخ',
                    'تزيين المدن',
                    'ترويج السياحة',
                    'التجارة'
                  ],
                  correctAnswer: 'توثيق التاريخ',
                ),
                Question(
                  questionText: 'ما هو العصر الذي استخدم فيه البرونز لأول مرة؟',
                  choices: ['الحجري', 'البرونزي', 'النحاسي', 'الحديدي'],
                  correctAnswer: 'البرونزي',
                ),
                Question(
                  questionText: 'ما هي المادة التي استخدمت في العصر الحجري؟',
                  choices: ['الحجر', 'النحاس', 'الحديد', 'الرصاص'],
                  correctAnswer: 'الحجر',
                ),
                Question(
                  questionText: 'أي عصر تميز باستخدام الحديد؟',
                  choices: ['الحديدي', 'الحجري', 'النحاسي', 'البرونزي'],
                  correctAnswer: 'الحديدي',
                ),
              ]),
        ),
        Course(
          number: "الثالثة",
          title: 'العصر الحديث',
          isCompleted: false,
          content: '''
                # العصر الحديث

                ## **المقدمة**
                - **العصر الحديث:** هو الفترة التي تلت العصور الوسطى وشهدت تطورًا كبيرًا في العلوم والتكنولوجيا والاقتصاد.
                - **التاريخ:** بدأ العصر الحديث في أوروبا في القرن الخامس عشر الميلادي وانتهى في القرن التاسع عشر الميلادي.
                - **التطورات:** شهد العصر الحديث تطورات هائلة في مختلف المجالات الحياتية.

                ---

                ## **التطورات الاقتصادية**
                ### 1. **الثورة الصناعية**
                - **المفهوم:** هي الثورة التي شهدتها بريطانيا في القرن الثامن عشر الميلادي وأدت إلى تحول كبير في الاقتصاد والصناعة.
                - **التأثيرات:** أدت الثورة الصناعية إلى تطور الصناعة وزيادة الإنتاجية وتحسين مستوى المعيشة.

                ### 2. **التطورات الاجتماعية**
                - **التغيرات:** شهد العصر الحديث تغيرات كبيرة في الهيكل الاجتماعي والقيم والعادات نتيجة للتطورات الاقتصادية والثقافية.
                - **التحديات:** واجهت المجتمعات الحديثة تح''',
          quiz: Quiz(
            title: 'Quiz on دراسة الآثار القديمة',
            questions: [
              Question(
                questionText: 'What is the main material of the statue?',
                choices: ['Marble', 'Granite', 'Limestone', 'Sandstone'],
                correctAnswer: 'Marble',
              ),
              Question(
                questionText: 'In which century was the statue created?',
                choices: [
                  '1st century',
                  '2nd century',
                  '3rd century',
                  '4th century'
                ],
                correctAnswer: '2nd century',
              ),
            ],
          ),
        ),
        Course(
          number: "الرابعة",
          title: 'العصر النووي',
          isCompleted: false,
          content: '''
                # العصر النووي

                ## **المقدمة**
                - **العصر النووي:** هو الفترة التي تلت العصر الحديث وشهدت تطورًا كبيرًا في مجال الطاقة النووية والتكنولوجيا.
                - **التاريخ:** بدأ العصر النووي في القرن العشرين الميلادي وما زال مستمرًا حتى اليوم.
                - **التطورات:** شهد العصر النووي تطورات هائلة في مجال الطاقة النووية والأسلحة النووية.

                ---

                ## **التطورات العلمية**
                ### 1. **الطاقة النووية**
                - **المفهوم:** هي الطاقة التي تستخرج من تفاعلات نووية في الذرات وتستخدم في توليد الكهرباء والطاقة الحرارية.
                - **الاستخدامات:** تستخدم الطاقة النووية في توليد الكهرباء وتشغيل المفاعلات النووية وتحلية المياه والتدفئة.

                ### 2. **الأسلحة النووية**
                - **التأثيرات:** أدت الأسلحة النووية إلى تغيير مفهوم الحرب والسلم وتهديد الأمن الدولي والسلم العالمي.
                - **التحديات:** تواجه الدول النووية تحديات كب''',
          quiz: Quiz(
            title: 'اختبار: دراسة الآثار القديمة',
            questions: [
              Question(
                questionText: 'ما المادة الرئيسية للتمثال؟',
                choices: ['رخام', 'جرانيت', 'حجر جيري', 'خشب'],
                correctAnswer: 'رخام',
              ),
              Question(
                questionText: 'في أي مدينة تم اكتشاف التمثال؟',
                choices: ['تيبازة', 'تيمقاد', 'جميلة', 'قالمة'],
                correctAnswer: 'تيبازة',
              ),
              Question(
                questionText: 'ما هو الدور الرمزي للتمثال؟',
                choices: [
                  'تمثيل ديني',
                  'تمثيل اجتماعي',
                  'تمثيل تجاري',
                  'تمثيل سياسي'
                ],
                correctAnswer: 'تمثيل ديني',
              ),
              Question(
                questionText: 'ما العصر الذي ينتمي إليه التمثال؟',
                choices: ['الروماني', 'العثماني', 'البيزنطي', 'الإسلامي'],
                correctAnswer: 'الروماني',
              ),
            ],
          ),
        ),
      ],
      backgroundImage: 'assets/images/chapter2.jpg',
    ),
    /*Chapter(
        number: "الوحدة التعليمية الثالثة",
        title: 'التاريخ العام',
        courses: [
          Course(
              number: "الأولى",
              title: 'العصور القديمة',
              isCompleted: true,
              content: ''),
          Course(
              number: "الثانية",
              title: 'العصور الوسطى',
              isCompleted: false,
              content: ''),
          Course(
              number: "الثالثة",
              title: 'العصور الجديدة',
              isCompleted: false,
              content: ''),
          Course(
              number: "الرابعة",
              title: 'العصور الحديثة',
              isCompleted: false,
              content: ''),
        ],
        backgroundImage: 'assets/images/chapter3.jpg',
      ),*/
  ];
}
