// lib/data/level_years.dart

final Map<String, List<String>> levelYears = {
  'الإبتدائي': [
    "الأولى إبتدائي",
    "الثانية إبتدائي",
    "الثالثة إبتدائي",
    "الرابعة إبتدائي",
    "الخامسة إبتدائي"
  ],
  'المتوسط': [
    "الأولى متوسط",
    "الثانية متوسط",
    "الثالثة متوسط",
    "الرابعة متوسط"
  ],
  'الثانوي': ["الأولى ثانوي", "الثانية ثانوي", "الثالثة ثانوي"],
  'الجامعي': [
    "الأولى جامعي",
    "الثانية جامعي",
    "الثالثة جامعي",
    "الرابعة جامعي",
    "الخامسة جامعي",
  ],
};
